uat_chat/Documents/Разнарядка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>Разнарядка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЗаявкиИзРазнарядки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКопирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Задания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заявка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Водитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смена1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныйМаршрут</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПечатьПоКА</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВремяС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лист</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

uat_chat/InformationRegisters/ЗаявкиИзРазнарядки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ЗаявкиИзРазнарядки</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Усл1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Усл2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Усл3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Смена1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/Catalogs/уатМаршруты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>уатМаршруты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерМаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расстояние</Name>
					<Comment>Расстояние</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НулевойПробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеМаршрутаОднимПунктом</Name>
					<Comment>Ложь-пары пунктов, Истина-один пункт</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВПути</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платформа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоянка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответсвенный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВЫВПеч</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяУсл2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяУсл3</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВПутиВод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяУсл2Вод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяУсл3Вод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйМаршрут</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦехКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦехаКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПоездки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПланыПоездок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияПП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПозицияПроизводсвеннойПрограммы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
					<Comment>Этапы движения по маршруту</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПунктОтправления</Name>
							<Comment>Пункт отправления</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПунктПрибытия</Name>
							<Comment>Пункт прибытия</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расстояние</Name>
							<Comment>Расстояние</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВПути</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

uat_chat/Documents/Разнарядка/Ext/ObjectModule.bsl
Функция ПолучитьДопМрш(ТБл,ТС)
	
	Стр ="";
	Мас = Тбл.НайтиСтроки(Новый Структура("ТС",ТС));
	ДЛя каждого эл из Мас Цикл
		Стр = Стр+Эл.Маршрут+" ; ";
	КонецЦИкла;
	
	Возврат Стр;
	
КонецФункции

Процедура ПечатьПодр(ТекПодр) экспорт
	Если Не уатОбщегоНазначенияТиповые.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	кэшМрш = Задания.Выгрузить(Новый Структура("ДополнительныйМаршрут",Истина));
	
	
	Запрос = Новый Запрос;
	Запрос.текст = "ВЫБРАТЬ
	               |	РазнарядкаЗадания.Маршрут.Владелец.Код КАК КодКА,
	               |	РазнарядкаЗадания.Маршрут.Владелец КАК Контрагент,
	               |	РазнарядкаЗадания.Маршрут.НаименованиеПолное Маршрут,
	               |	РазнарядкаЗадания.Маршрут.Ответсвенный КАК Ответсвенный,
	               |	РазнарядкаЗадания.Маршрут.Начало КАК Начало,
	               |	уатМестонахождениеТССрезПоследних.ТС,
	               |	уатМестонахождениеТССрезПоследних.ТС.ГосударственныйНомер КАК ГосНомер,
	               |	уатМестонахождениеТССрезПоследних.ТС.ГаражныйНомер КАК ГарНомер,
	               |	ВЫБОР
	               |		КОГДА РазнарядкаЗадания.Маршрут ЕСТЬ NULL 
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Инд,
	               |	РазнарядкаЗадания.Маршрут.ВремяВПути ЧасыЛ,
	               |	РазнарядкаЗадания.Маршрут.ВремяУсл3 ЧасыР,
	               |	РазнарядкаЗадания.Маршрут.ВремяУсл2 ЧасыО,
	               |	РазнарядкаЗадания.Маршрут.ВремяВПутиВод ЧасыЛВод,
	               |	РазнарядкаЗадания.Маршрут.ВремяУсл3Вод ЧасыРВод,
	               |	РазнарядкаЗадания.Маршрут.ВремяУсл2Вод ЧасыОВод
	               |ИЗ
	               |	РегистрСведений.уатМестонахождениеТС.СрезПоследних(&ДТ) КАК уатМестонахождениеТССрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Разнарядка.Задания КАК РазнарядкаЗадания
	               |		ПО уатМестонахождениеТССрезПоследних.ТС = РазнарядкаЗадания.ТС
	               |			И (НАЧАЛОПЕРИОДА(РазнарядкаЗадания.Ссылка.Дата, ДЕНЬ) = &Дт)
	               |			И (РазнарядкаЗадания.Маршрут <> ЗНАЧЕНИЕ(Справочник.уатМаршруты.ПустаяСсылка))
	               |			И (РазнарядкаЗадания.ДополнительныйМаршрут = Ложь)
	               |WHERE   уатМестонахождениеТССрезПоследних.Подразделение = &Подр И (НЕ уатМестонахождениеТССрезПоследних.Состояние.ЗапретитьВыпискуПЛ)
	               |УПОРЯДОЧИТЬ ПО
	               |	Инд,
	               |	ГарНомер,
	               |	Начало";
				   Запрос.УстановитьПараметр("Дт",НачалоДня(Дата));
				   Запрос.УстановитьПараметр("Подр",ТекПодр);
				   Запрос.УстановитьПараметр("Док",Ссылка);
				   
	ТБл =Запрос.Выполнить().Выгрузить();
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	
			 Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");

	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.НазваниеОрганизации = СокрлП(Организация.НаименованиеПолное);
	Шапка.Параметры.ДатаДОк = Формат(Ссылка.Дата,"ДФ=dd.MM.yyyy");
	Шапка.Параметры.Подр = ТекПодр;
	Таб.Вывести(Шапка);
	
	Строка = Макет.ПолучитьОбласть("Строка0");
	ном = 1;
	пТС = Неопределено;
	ВысТаб=0;
	НольДата = Дата(1,1,1);
	Для каждого стр из Тбл Цикл
		
		ЗаполнитьЗначенияСвойств(Строка.Параметры,Стр);
		Строка.Параметры.Ном = Ном;
		Если Стр.ЧасыР = НольДата и Стр.ЧасыРВод<>НольДата Тогда
			Строка.Параметры.ЧасыР = Формат(Стр.ЧасыРВод,"ДФ=Ч")+" В";
		ИНачеЕсли Стр.ЧасыР <> НольДата и Стр.ЧасыР <> null ТОгда
			Строка.Параметры.ЧасыР = Формат(Стр.ЧасыР,"ДФ=Ч")+" р";
		КонецЕСЛИ;
		Строка.Параметры.Комм = ПолучитьДопМрш(кэшМрш,Стр.ТС);
		Таб.Вывести(Строка);
		
		Если пТС = Стр.ТС Тогда
			Таб.Область(высТаб,7,Таб.ВысотаТаблицы,7).Объединить();
			Таб.Область(высТаб,8,Таб.ВысотаТаблицы,8).Объединить();
			Таб.Область(высТаб,13,Таб.ВысотаТаблицы,14).Объединить();
		ИНаче
			пТс = Стр.ТС;
			Ном=Ном+1;
			ВысТаб = Таб.ВысотаТаблицы;
		КонецЕслИ;
		
	КонецЦикла;
	Подвал = Макет.ПолучитьОбласть("Подвал");
	Таб.Вывести(Подвал);
	
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	Таб.ПовторятьПриПечатиСтроки = Таб.Область(6,,7,);
	Таб.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ксРазнарядка";
	Таб.Показать("ПечРазнарядка");
				   
				   
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РазнарядкаЗадания.ТС КАК ТС,
	               |	РазнарядкаЗадания.Водитель КАК Водитель,
	               |	РазнарядкаЗадания.Смена1 КАК Смена1,
	               |	РазнарядкаЗадания.Маршрут.Владелец КА,
	               |	РазнарядкаЗадания.Маршрут,
	               |	Час(РазнарядкаЗадания.Маршрут.ВремяВПути) Усл1,
	               |	Час(РазнарядкаЗадания.Маршрут.ВремяУсл2)  Усл2,
	               |	Час(РазнарядкаЗадания.Маршрут.ВремяУсл3)  Усл3
	               |ИЗ
	               |	Документ.Разнарядка.Задания КАК РазнарядкаЗадания
				   |WHERE Ссылка = &сс  и  РазнарядкаЗадания.ТС <> Значение(Справочник.уатТС.пустаяСсылка)
				   |ORDER BY РазнарядкаЗадания.Маршрут.ВремяВПути DESC
	               |ИТОГИ ПО
	               |	ТС,
				   |	Водитель,
	               |	Смена1";
				   Запрос.УстановитьПараметр("сс",ссылка);
	Выборка	= Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Наб = Движения.ЗаявкиИзРазнарядки;
	
	
	Пока Выборка.Следующий() Цикл  //ТС
		
		Есть1смена = Ложь;
		Есть2Смена = Ложь;
		
		ВыбВод = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыбВод.Следующий() Цикл  //Водитель
			
			Выб = ВыбВод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);   //Смена
			Пока Выб.Следующий() Цикл
				
				ВыбКА = Выб.Выбрать();  //Детальные записи
				Если ВыбКА.Следующий() Тогда
					Если ВыбКА.Смена1 и Есть1Смена = Истина ТОгда
						Продолжить;
					ИНачеЕсли  Есть2Смена = Истина Тогда
						Продолжить;
					КонецЕСЛИ;
					
					Зап = Наб.Добавить();
					Зап.Период = Дата;
					Зап.Регистратор = ссылка;
					Зап.Контрагент  = ВыбКА.КА;
					Зап.Смена1 = ВыбКА.Смена1;
					Зап.ТС     = ВыбКА.ТС;
					Зап.Усл1   = ВыбКА.Усл1;
					Зап.Усл2   = ВыбКА.Усл2;
					Зап.Усл3   = ВыбКА.Усл3;
					Зап.Маршрут= ВыбКА.Маршрут;
					
					Если ВыбКА.Смена1 ТОгда
						Есть1Смена = Истина;
					ИНаче
						Есть2Смена = Истина;
					КонецЕСЛИ;
				КонецЕСЛИ;
				
				
				//Если ЗначениеЗаполнено(ВыбВод.Водитель) Тогда
					Прервать;      // На одну машину - одна заявка
				//КонецеСЛИ;
				
				Если Есть1Смена и Есть2Смена ТОгда ПрерватЬ; КонецЕСЛИ;
					
			КонеЦЦикла;
			
					Прервать;      // На одну машину - одна заявка
			Если Есть1Смена и Есть2Смена ТОгда ПрерватЬ; КонецЕСЛИ;
			
		КонеЦЦикла;
		
	КонецЦикла;
	
	Наб.Записать();
				   
КонецПроцедуры
